'use strict';

var recipe = {
	wp01:[
		{name:'長劍', mts:[{'m101':4},{'w01':20}], level:1, code:'1a'},
		{name:'闊劍', mts:[{'m101':4},{'m102':3},{'w01':20}], level:1, code:'1b'},
		{name:'突刺劍', mts:[{'m101':5},{'m102':4},{'w01':20}], level:2, code:'2a'},
		{name:'火舌劍', mts:[{'m101':7},{'m102':5},{'w02':20},{'w03':20}], level:2, code:'2b'},
		{name:'麵包劍', mts:[{'m101':7},{'m102':6},{'m103':5}], level:3, code:'3a'},
		{name:'雙手劍', mts:[{'m102':10},{'m103':8},{'w02':20},{'w04':20}], level:3, code:'3b'},
		{name:'雙刃長劍', mts:[{'m101':15},{'m102':5},{'m104':5},{'w03':20}], level:4, code:'4a'},
		{name:'鎖刃劍', mts:[{'m102':10},{'m104':7},{'m105':5},{'w03':20}], level:4, code:'4b'},
		{name:'格鬥劍', mts:[{'m102':10},{'m103':3},{'m104':6},{'m105':7},{'w04':20}], level:5, code:'5a'},
		{name:'長鍔劍', mts:[{'m101':10},{'m102':8},{'m103':7},{'m105':8},{'w06':20}], level:5, code:'5b'},
		{name:'黑作太刀', mts:[{'m101':10},{'m102':10},{'m103a':7},{'m105':7},{'w06':20}], level:5, code:'5c'},
		{name:'豬牙劍', mts:[{'m103':10},{'m104':10},{'m106':8},{'w04':20},{'w05':20}], level:6, code:'6a'},
		{name:'雙刃闊劍', mts:[{'m104':6},{'m105':10},{'m106':10},{'w05':20},{'w07':20}], level:6, code:'6b'},
		{name:'巨劍', mts:[{'m104':15},{'m106':10},{'m107':7},{'w06':20},{'s07':1}], level:7, code:'7a'},
		{name:'長軍刀', mts:[{'m103':10},{'m105':13},{'m107':11},{'w01':20},{'w07':20}], level:7, code:'7b'},
		{name:'水龍之劍', mts:[{'wd01':1},{'s07':2},{'s06':2},{'m107':20}], level:7, code:'7c'},
		{name:'護身短劍', mts:[{'m101':15},{'m106':16},{'m107':13},{'w08':20},{'s06':1}], level:8, code:'8a'},
		{name:'細柄短劍', mts:[{'m107':10},{'m108':13},{'w02':20},{'w06':20},{'w08':20}], level:8, code:'8b'},
		{name:'長軍刀+', mts:[{'m107':18},{'m108':18},{'w08':20},{'m008b':20},{'m008c':20}], level:8, code:'8c'},
		{name:'細刃重劍', mts:[{'m102':10},{'m106':10},{'m107':10},{'m108':10},{'w09':20}], level:9, code:'9a'},
		{name:'剛硬巨劍', mts:[{'m104':10},{'m108':10},{'m109':10},{'w05':20},{'s07':2}], level:9, code:'9b'},
		{name:'青龍刀', mts:[{'m105':10},{'m108':10},{'m109':10},{'w08':20},{'w10':20}], level:10, code:'10a'},
		{name:'曲刀', mts:[{'m108':10},{'m110':10},{'w09':20},{'s07':2},{'s06':2}], level:10, code:'10b'},
		{name:'彎勾劍', mts:[{'m108a':5},{'m109':4},{'w10':40},{'w09':40},{'s07':2}], level:11, code:'11a'},
		{name:'剛毅', mts:[{'m108a':4},{'m108':5},{'m109':5},{'w10':40},{'s06':2}], level:11, code:'11b'},
		{name:'烏金劍', mts:[{'s06':5},{'w11':40},{'w10a':40},{'m110b':7},{'m110':5}], level:11, code:'11c'},
		{name:'流瑩劍', mts:[{'s07':5},{'m112':10},{'w10a':40},{'m110b':10},{'m110':7}], level:12, code:'12a'},
		{name:'碎藥之劍', mts:[{'s06':7},{'m110':17},{'m112':8},{'w11':20},{'w12':20}], level:12, code:'12c'},
		{name:'追風劍', mts:[{'m008c':20},{'w13':40},{'w12':40},{'m112':10},{'m111':7}], level:13, code:'13a'},
		{name:'逐霓劍', mts:[{'s06':10},{'m113':7},{'w12':40},{'m112':12},{'m111':10}], level:14, code:'14a'},
		{name:'兩儀劍', mts:[{'m010c':2},{'w14':40},{'w13':40},{'m114':12},{'m113':10}], level:15, code:'15a'}
	],
// 11C劍：烏金劍
// 魔族的水晶5 棗木40 月桂木40 雅達曼鎝條7 奧利哈鋼條5
// 12劍：流瑩劍
// 鋼騎之礦5 鉛錠10 月桂木40 雅達曼鎝條10 奧利哈鋼條7
// 12C劍：碎藥之劍
// 魔族的水晶7 奧利哈剛17 鉛錠8 棗木20 藤木20
// 13劍：追風劍
// 藍龍之鱗20 桃花心木40 藤木40 鉛錠10 石墨條7
// 14劍：逐霓劍
// 魔族的水晶10 朱砂錠7 藤木40 鉛錠12 石墨條10
// 15劍：兩儀劍
// 太古的道具2 檜木40 桃花心木40 紫英石10 朱砂錠10
	wp02:[
		{name:'手斧', mts:[{'m101':4},{'w01':20}], level:1, code:'1a'},
		{name:'勇氣之斧', mts:[{'m101':4},{'m102':3},{'w01':20}], level:1, code:'1b'},
		{name:'寬手斧', mts:[{'m101':7},{'m102':4},{'w01':20},{'w02':20}], level:2, code:'2a'},
		{name:'戰鬥手斧', mts:[{'m102':10},{'m103':5},{'w01':20},{'w02':20}], level:2, code:'2b'},
		{name:'格鬥手斧', mts:[{'m101':9},{'m102':5},{'m103':5},{'w03':20}], level:3, code:'3a'},
		{name:'鋼斧', mts:[{'m101':10},{'m102':9},{'m104':4},{'w03':20}], level:3, code:'3b'},
		{name:'長戰斧', mts:[{'m101':8},{'m102':8},{'m103':7},{'m104':3},{'w04':20}], level:4, code:'4a'},
		{name:'雙刃斧', mts:[{'m102':10},{'m103':7},{'m104':5},{'m105':4},{'w01':20}], level:4, code:'4b'},
		{name:'鉤爪斧', mts:[{'m103':10},{'m104':10},{'m105':5},{'w02':20},{'w05':20}], level:5, code:'5a'},
		{name:'闊刃斧', mts:[{'m102':10},{'m103':10},{'m104':10},{'m106':2},{'w05':20}], level:5, code:'5b'},
		{name:'鑽保雷格之斧', mts:[{'m103a':7},{'m102':10},{'m104':7},{'m106':2},{'w05':20}], level:5, code:'5c'},
		{name:'彎月大戰斧', mts:[{'m104':10},{'m105':10},{'m106':6},{'w03':20},{'w06':20}], level:6, code:'6a'},
		{name:'大型闊刃斧', mts:[{'m103':8},{'m104':10},{'m105':10},{'m107':3},{'w06':20}], level:6, code:'6b'},
		{name:'大型雙刃斧', mts:[{'m102':20},{'m106':12},{'m107':6},{'w05':20},{'w06':20}], level:7, code:'7a'},
		{name:'超大皇帝斧', mts:[{'m104':20},{'m106':10},{'m107':10},{'w07':20},{'s08':1}], level:7, code:'7b'},
		{name:'水龍之斧', mts:[{'wd02':1},{'s07':2},{'s06':2},{'m107':20}], level:7, code:'7c'},
		{name:'新月斧', mts:[{'m105':13},{'m106':10},{'m108':10},{'w06':20},{'w07':20}], level:8, code:'8a'},
		{name:'米諾陶斯戰斧', mts:[{'m104':10},{'m107':10},{'m108':10},{'w08':20},{'s06':1}], level:8, code:'8b'},
		{name:'大型雙刃斧+', mts:[{'m107':20},{'m108':12},{'w08':20},{'m008b':20},{'m008c':20}], level:8, code:'8c'},
		{name:'薄刃鉤爪斧', mts:[{'m106':10},{'m107':10},{'m109':10},{'w07':20},{'w08':20}], level:9, code:'9a'},
		{name:'彎月長柄斧', mts:[{'m105':10},{'m108':10},{'m109':10},{'w09':20},{'s08':2}], level:9, code:'9b'},
		{name:'金屬重斧', mts:[{'m107':10},{'m108':10},{'m110':8},{'w08':20},{'w09':20}], level:10, code:'10a'},
		{name:'處刑斧', mts:[{'m110':14},{'w10':20},{'s07':2},{'s06':2},{'s08':2}], level:10, code:'10b'},
		{name:'高速斧', mts:[{'m108a':8},{'m108':8},{'m109':6},{'w10':40},{'s07':2}], level:11, code:'11a'},
		{name:'重擊斧', mts:[{'m108a':3},{'m108':10},{'m107':9},{'w10':40},{'s06':2}], level:11, code:'11b'},
		{name:'百鍊斧', mts:[{'s06':5},{'m112':15},{'w10a':40},{'m110b':8},{'m110':7}], level:11, code:'11c'},
		{name:'飛龍斧', mts:[{'m008c':10},{'m111':20},{'w10a':40},{'m110b':10},{'m110':10}], level:12, code:'12a'},
		{name:'碎藥之斧', mts:[{'s09':3},{'w11':20},{'m110':17},{'m112':20},{'m111':15}], level:12, code:'12c'},
		{name:'巨闕斧', mts:[{'m108e':7},{'w13':30},{'w12':40},{'m112':12},{'m111':7}], level:13, code:'13a'},
		{name:'劈山神斧', mts:[{'s06':7},{'m113':7},{'w12':40},{'m112':12},{'m111':10}], level:14, code:'14a'}
	],
// 11C斧：百鍊斧
// 魔族的水晶5、鉛錠15、月桂木40、雅達曼鎝條8、奧利哈鋼條7
// 12斧：飛龍斧
// 藍龍之麟10、石墨條20、月桂木40、雅達曼鎝條10、奧利哈鋼條10
// 12C斧：碎藥之斧
// 得特家的布3、棗木20、奧利哈鋼條17、鉛錠20、石墨條15
// 12斧: 巨闕斧
// 亞爾登礦條7、桃花心木30、藤木40、鉛錠12、石墨條7
// 14斧：劈山神斧
// 魔族的水晶7、朱砂碇7、藤木40、鉛錠12、石墨條10
	wp03:[
		{name:'短矛', mts:[{'m101':4},{'w01':20}], level:1, code:'1a'},
		{name:'攻城槍', mts:[{'m101':5},{'m102':3},{'w01':20}], level:1, code:'1b'},
		{name:'刺槍', mts:[{'m101':7},{'m102':4},{'w01':20},{'w02':20}], level:2, code:'2a'},
		{name:'金屬槍', mts:[{'m101':8},{'m102':5},{'w01':20},{'w02':20}], level:2, code:'2b'},
		{name:'長柄彎槍', mts:[{'m101':10},{'m102':6},{'m103':3},{'w02':20},{'w03':20}], level:3, code:'3a'},
		{name:'長柄尖槍', mts:[{'m102':8},{'m103':6},{'m104':5},{'w02':20},{'w03':20}], level:3, code:'3b'},
		{name:'穗槍', mts:[{'m102':8},{'m103':7},{'m104':7},{'w03':20},{'w04':20}], level:4, code:'4a'},
		{name:'雙叉戟', mts:[{'m103':10},{'m104':10},{'m105':3},{'w03':20},{'w04':20}], level:4, code:'4b'},
		{name:'護衛槍', mts:[{'m103':15},{'m105':10},{'w03':20},{'w04':20},{'w05':20}], level:5, code:'5a'},
		{name:'騎士槍', mts:[{'m103':15},{'m106':10},{'w02':20},{'w04':20},{'w05':20}], level:5, code:'5b'},
		{name:'偃月刀', mts:[{'m102':10},{'m103a':5},{'w03a':20},{'w04':20},{'w05':20}], level:5, code:'5c'},
		{name:'大砍槍', mts:[{'m104':7},{'m105':8},{'m106':10},{'w05':20},{'w06':20}], level:6, code:'6a'},
		{name:'長尖槍', mts:[{'m105':9},{'m106':10},{'m107':5},{'w04':20},{'w06':20}], level:6, code:'6b'},
		{name:'蠍槍', mts:[{'m103':15},{'m106':10},{'m107':8},{'w03':20},{'w07':20}], level:7, code:'7a'},
		{name:'雙刃槍', mts:[{'m106':10},{'m107':14},{'s07':1},{'w06':20},{'w07':20}], level:7, code:'7b'},
		{name:'水龍之槍', mts:[{'wd03':1},{'s07':2},{'s06':2},{'m107':20}], level:7, code:'7c'},
		{name:'闊刃槍', mts:[{'m108':20},{'w04':20},{'w05':20},{'w06':20},{'w07':20}], level:8, code:'8a'},
		{name:'東方長刺鎗', mts:[{'m106':9},{'m107':9},{'m108':10},{'w08':20},{'s06':1}], level:8, code:'8b'},
		{name:'蠍槍+', mts:[{'m107':17},{'m108':13},{'w08':20},{'m008b':20},{'m008c':20}], level:8, code:'8c'},
		{name:'鉤爪槍', mts:[{'m109':15},{'w05':20},{'w06':20},{'w07':20},{'w08':20}], level:9, code:'9a'},
		{name:'原始槍', mts:[{'m107':10},{'m108':10},{'m109':10},{'w09':20},{'s07':2}], level:9, code:'9b'},
		{name:'三叉戰戟', mts:[{'m110':10},{'w06':20},{'w07':20},{'w08':20},{'w09':20}], level:10, code:'10a'},
		{name:'異型槍', mts:[{'m108':10},{'m109':10},{'m110':10},{'w10':20},{'s06':3}], level:10, code:'10b'},
		{name:'痛擊槍', mts:[{'m109':9},{'w09':40},{'w08a':40},{'w10':40},{'s07':2}], level:11, code:'11a'},
		{name:'穿刺槍', mts:[{'m108':13},{'w09':40},{'w08a':40},{'w10':40},{'s06':2}], level:11, code:'11b'},
		{name:'烈火槍', mts:[{'s05':5},{'m110a':7},{'w11':40},{'w10':40},{'w10a':40}], level:11, code:'11c'},
		{name:'鬼戈', mts:[{'s06':7},{'m110':10},{'w11':40},{'w10':40},{'w10a':40}], level:12, code:'12a'},
		{name:'碎藥之槍', mts:[{'s07':4},{'w12':20},{'w11':20},{'m111':12},{'m112':7}], level:12, code:'12c'},
		{name:'疾風槍', mts:[{'m008c':12},{'m111':12},{'w11':40},{'w10':40},{'w12':40}], level:13, code:'13a'},
		{name:'落雷之槍', mts:[{'s08':7},{'m114':12},{'w13':40},{'w14':40},{'w12':40}], level:14, code:'14a'},
		{name:'丈八蛇矛', mts:[{'m010c':2},{'m114':15},{'w13':40},{'w14':40},{'w12':40}], level:15, code:'15a'}
	],
// 11C槍：烈火槍
// 火焰之魂5、喜馬拉斯礦條7、棗木40、梣40、月桂木40
// 12槍：鬼戈
// 魔族的水晶7、奧利哈鋼條10、棗木40、梣40、月桂木40
// 12C槍：碎藥之槍
// 鋼騎之礦4、藤木20、棗木20、石墨條12、鉛錠7
// 13槍：疾風槍
// 藍龍之麟12、石墨條12、棗木40、梣40、藤木40
// 14槍：落雷之槍
// 誓言之證7、紫英石12、桃花心木40、檜木40、藤木40
// 15槍：丈八蛇矛
// 太古的道具2、紫英石15、桃花心木40、檜木40、藤木40
	wp04:[
		{name:'輕型弓', mts:[{'m101':3},{'w01':20},{'c101':1}], level:1, code:'1a'},
		{name:'威力短弓', mts:[{'m101':2},{'w01':20},{'w02':20},{'c101':3},{'c102':2}], level:1, code:'1b'},
		{name:'短戰弓', mts:[{'m102':2},{'w01':20},{'w02':20},{'c101':5},{'c102':4}], level:2, code:'2a'},
		{name:'獵弓', mts:[{'m102':4},{'w02':20},{'w03':20},{'c101':3},{'c102':6}], level:2, code:'2b'},
		{name:'強弓', mts:[{'m103':8},{'w01':20},{'w02':20},{'w03':20},{'c103':7}], level:3, code:'3a'},
		{name:'格鬥弓', mts:[{'m103':9},{'w02':20},{'w03':20},{'w04':20},{'c103':9}], level:3, code:'3b'},
		{name:'狙擊弓', mts:[{'m104':10},{'w02':20},{'w03':20},{'w04':20},{'c103':10}], level:4, code:'4a'},
		{name:'超強狙擊弓', mts:[{'m104':11},{'w03':20},{'w04':20},{'w05':20},{'c104':11}], level:4, code:'4b'},
		{name:'殺手長弓', mts:[{'m104':9},{'m105':11},{'w04':20},{'w05':20},{'c103':5}], level:5, code:'5a'},
		{name:'衝擊弓', mts:[{'m103':5},{'m105':19},{'w04':20},{'w05':20},{'w06':20}], level:5, code:'5b'},
		{name:'米斯特汀之弓', mts:[{'m103a':19},{'m105':15},{'w03a':20},{'w05':20},{'w06':20}], level:5, code:'5c'},
		{name:'巨弓', mts:[{'m105':12},{'m106':11},{'w04':20},{'w05':20},{'w06':20}], level:6, code:'6a'},
		{name:'長格鬥弓', mts:[{'m105':13},{'m106':12},{'w05':20},{'w06':20},{'w07':20}], level:6, code:'6b'},
		{name:'破邪長弓', mts:[{'m106':10},{'m107':10},{'c106':6},{'w07':20},{'s08':1}], level:7, code:'7a'},
		{name:'月光長弓', mts:[{'m106':8},{'m107':16},{'w05':20},{'w06':20},{'w07':20}], level:7, code:'7b'},
		{name:'水龍之弓', mts:[{'wd04':1},{'s07':2},{'s06':2},{'w07':20}], level:7, code:'7c'},
		{name:'原始石弓', mts:[{'m106':20},{'m107':14},{'w07':20},{'w08':20},{'s06':1}], level:8, code:'8a'},
		{name:'重弦弓', mts:[{'m107':11},{'m108':12},{'w06':20},{'w07':20},{'w08':20}], level:8, code:'8b'},
		{name:'月光之弓+', mts:[{'m108':20},{'w07':20},{'w08':20},{'g08d':10},{'m008c':20}], level:8, code:'8c'},
		{name:'平行弓', mts:[{'m107':15},{'m108':15},{'w07':20},{'w08':20},{'w09':20}], level:9, code:'9a'},
		{name:'靈魂之弓', mts:[{'m108':15},{'m109':10},{'w08':20},{'w09':20},{'s07':2}], level:9, code:'9b'},
		{name:'摘星之弓', mts:[{'m108':20},{'m109':10},{'w08':20},{'w09':20},{'w10':20}], level:10, code:'10a'},
		{name:'魔彈', mts:[{'m109':6},{'m110':10},{'w09':20},{'w10':20},{'s06':4}], level:10, code:'10b'},
		{name:'調和之弓', mts:[{'m108a':4},{'m109':3},{'w09':40},{'w10':20},{'s06':2}], level:11, code:'11a'},
		{name:'月之弓', mts:[{'m108':13},{'m109':9},{'w08a':40},{'w10':40},{'s05':2}], level:11, code:'11b'},
		{name:'連弩', mts:[{'m001b':5},{'m110a':7},{'m110b':11},{'w10':40},{'w10a':40}], level:11, code:'11c'},
		{name:'落星弓', mts:[{'s07':5},{'m110a':10},{'m110':11},{'w11':40},{'w10a':40}], level:12, code:'12a'},
		{name:'碎藥之弓', mts:[{'s06':7},{'m110':17},{'m112':8},{'w11':20},{'w12':20}], level:12, code:'12c'},
		{name:'穿雲弓', mts:[{'s07':5},{'m112':13},{'m113':13},{'w11':40},{'w12':40}], level:13, code:'13a'},
		{name:'射日弓', mts:[{'s08':5},{'m114':13},{'m112':13},{'w14':40},{'w13':40}], level:14, code:'14a'},
		{name:'七彩琉璃弓', mts:[{'m001a':2},{'m114':15},{'m113':15},{'w14':40},{'w13':40}], level:15, code:'15a'}
	],
// 11C弓：連弩
// 瑪瑙5、喜馬拉斯礦條7、雅達曼鎝條11、梣40、月桂木40
// 12弓：落星弓
// 鋼騎之礦5 喜馬拉斯礦條10 奧利哈剛11 棗木40 月桂木40
// 12C弓：碎藥之弓
// 魔族的水晶7 奧利哈剛17 鉛錠8 棗木20 藤木20
// 13弓：穿雲弓
// 鋼鐵之礦5 鉛錠13 朱砂錠13 棗木40 藤木40
// 14弓：射日弓
// 誓言之證5 紫英石13 鉛錠13 檜木40 桃花心木40
// 15弓：七彩琉璃弓
// 天青石2 紫英石15 朱砂錠15 檜木40 桃花心木40
	wp05:[
		{name:'短杖', mts:[{'m101':4},{'w01':20}], level:1, code:'1a'},
		{name:'權杖', mts:[{'m101':6},{'m102':2},{'w01':20}], level:1, code:'1b'},
		{name:'大地之杖', mts:[{'m102':10},{'w01':20},{'w02':20}], level:2, code:'2a'},
		{name:'激流權杖', mts:[{'m102':12},{'w01':20},{'w02':20},{'w03':20}], level:2, code:'2b'},
		{name:'魔之手杖', mts:[{'m102':14},{'m103':2},{'w01':20},{'w02':20},{'w03':20}], level:3, code:'3a'},
		{name:'魔之權杖', mts:[{'m102':11},{'m103':8},{'w01':20},{'w03':20},{'w04':20}], level:3, code:'3b'},
		{name:'賢者手杖', mts:[{'m103':10},{'m104':10},{'w01':20},{'w02':20},{'w04':20}], level:4, code:'4a'},
		{name:'賢者權杖', mts:[{'m103':12},{'m104':12},{'w02':20},{'w04':20},{'w05':20}], level:4, code:'4b'},
		{name:'琥珀杖', mts:[{'m105':16},{'w02':20},{'w03':20},{'w04':20},{'w05':20}], level:5, code:'5a'},
		{name:'琥珀權杖', mts:[{'m105':17},{'w03':20},{'w04':20},{'w05':20},{'w06':20}], level:5, code:'5b'},
		{name:'魔晶之杖', mts:[{'m103a':7},{'w03a':20},{'w04':20},{'w05':20},{'w06':20}], level:5, code:'5c'},
		{name:'元素之杖', mts:[{'m106':16},{'w03':20},{'w04':20},{'w05':20},{'w06':20}], level:6, code:'6a'},
		{name:'神聖之杖', mts:[{'m106':17},{'w04':20},{'w05':20},{'w06':20},{'w07':20}], level:6, code:'6b'},
		{name:'怒音之杖', mts:[{'m107':18},{'w04':20},{'w05':20},{'w06':20},{'w07':20}], level:7, code:'7a'},
		{name:'隱者之杖', mts:[{'m106':12},{'m107':9},{'w05':20},{'w06':20},{'w07':20}], level:7, code:'7b'},
		{name:'水龍之杖', mts:[{'wd05':1},{'s07':2},{'s06':2},{'w07':20}], level:7, code:'7c'},
		{name:'光明短杖', mts:[{'m106':10},{'m107':12},{'w06':20},{'w07':20},{'w08':20}], level:8, code:'8a'},
		{name:'惡魔之杖', mts:[{'m107':10},{'m108':7},{'w06':20},{'w07':20},{'w08':20}], level:8, code:'8b'},
		{name:'落雷權杖+', mts:[{'m108':15},{'w07':20},{'w08':20},{'g08d':10},{'m008c':20}], level:8, code:'8c'},
		{name:'太陽短杖', mts:[{'m108':15},{'w08':20},{'w09':20}], level:9, code:'9a'},
		{name:'天使之杖', mts:[{'m108':15},{'w08':20},{'w09':20}], level:9, code:'9b'},
		{name:'聖者之杖', mts:[{'m110':10},{'w09':20}], level:10, code:'10a'},
		{name:'星屑短杖', mts:[{'m109':15},{'w09':20},{'w10':20}], level:10, code:'10b'},
		{name:'王者之手', mts:[{'m108a':3},{'m109':3},{'w09':40},{'w10':40},{'s06':1}], level:11, code:'11a'},
		{name:'星錘杖', mts:[{'m109':3},{'w08a':40},{'w09':40},{'w10':40},{'s06':1}], level:11, code:'11b'},
		{name:'紅蓮杖', mts:[{'s05':5},{'m110b':7},{'w09':40},{'w10a':40},{'w11':40}], level:11, code:'11c'},
		{name:'貔貅杖', mts:[{'m001b':7},{'m108':10},{'w10a':40},{'w10':40},{'w11':40}], level:12, code:'12a'},
		{name:'碎藥之法杖', mts:[{'s06':4},{'m110':18},{'m112':9},{'w11':20},{'w12':20}], level:12, code:'12c'},
		{name:'碎藥之權杖', mts:[{'s05':3},{'s08':4},{'m111':13},{'w11':20},{'w12':20}], level:12, code:'12d'},
		{name:'鬼頭杖', mts:[{'s07':7},{'m111':10},{'w10':40},{'w12':40},{'w11':40}], level:13, code:'13a'},
		{name:'青蛇杖', mts:[{'m001a':2},{'m112':13},{'w13':40},{'w12':40},{'w14':40}], level:14, code:'14a'},
		{name:'追魂杖', mts:[{'s08':10},{'m114':15},{'w13':40},{'w12':40},{'w14':40}], level:15, code:'15a'}
	],
// 11C杖：紅蓮杖
// 火焰之魂5、雅達曼鎝條7、絲柏40、月桂木40、棗木40
// 12杖：貔貅杖
// 瑪瑙7、幻之銀條10、月桂木40、梣40、棗木40
// 12C杖：碎藥之法杖
// 魔族的水晶4 奧利哈剛18 鉛錠9 棗木20 藤木20
// 12D杖：碎藥之權杖
// 火焰之魂3 誓言之證4 石墨條13 棗木20 藤木20
// 13杖：鬼頭杖
// 鋼騎之礦7、石墨條10、梣40、藤木40、棗木40
// 14杖：青蛇杖
// 天青石2、鉛錠13、桃花心木40、藤木40、檜木40
// 15杖：追魂杖
// 誓言之證10、紫英石15、桃花心木40、藤木40、檜木40
	wp06:[
		{name:'小刀', mts:[{'m101':4},{'w01':20}], level:1, code:'1a'},
		{name:'銳刃小刀', mts:[{'m101':4},{'m102':4},{'w02':20}], level:1, code:'1b'},
		{name:'圓盤小刀', mts:[{'m101':6},{'m102':3},{'w02':20},{'c102':3}], level:2, code:'2a'},
		{name:'細刃擲刀', mts:[{'m102':7},{'m103':3},{'w02':20},{'w03':20},{'c102':4}], level:2, code:'2b'},
		{name:'滑翔小刀', mts:[{'m102':8},{'m103':5},{'w02':20},{'w03':20},{'c103':4}], level:3, code:'3a'},
		{name:'細直刃小刀', mts:[{'m103':7},{'m104':5},{'w03':20},{'w04':20},{'c103':7}], level:3, code:'3b'},
		{name:'耳柄小刀', mts:[{'m103':8},{'m104':7},{'w03':20},{'w04':20},{'c104':7}], level:4, code:'4a'},
		{name:'騎士小刀', mts:[{'m104':8},{'m105':7},{'w04':20},{'w05':20},{'c104':8}], level:4, code:'4b'},
		{name:'球鍔小刀', mts:[{'m104':7},{'m105':8},{'w04':20},{'w05':20},{'c105':8}], level:5, code:'5a'},
		{name:'雙刃小刀', mts:[{'m104':8},{'m105':7},{'m106':7},{'w04':20},{'w06':20}], level:5, code:'5b'},
		{name:'忍者飛鏢', mts:[{'m103a':6},{'m104':5},{'m106':5},{'w04':20},{'w06':20}], level:5, code:'5c'},
		{name:'闊刃小刀', mts:[{'m104':8},{'m105':7},{'m106':8},{'w05':20},{'w06':20}], level:6, code:'6a'},
		{name:'觸角小刀', mts:[{'m107':15},{'w05':20},{'w06':20}], level:6, code:'6b'},
		{name:'漢拉提小刀', mts:[{'m107':10},{'w06':20},{'w07':20},{'c105':10},{'s13':1}], level:7, code:'7a'},
		{name:'兇殺刀', mts:[{'m106':10},{'m107':10},{'w04':20},{'w06':20},{'w07':20}], level:7, code:'7b'},
		{name:'水龍的小刀', mts:[{'wd06':1},{'s07':2},{'s06':2},{'m107':10}], level:7, code:'7c'},
		{name:'切肉小刀', mts:[{'m107':20},{'w06':20},{'w07':20},{'w08':20},{'s06':1}], level:8, code:'8a'},
		{name:'古傳小刀', mts:[{'m108':14},{'w03':20},{'w04':20},{'w06':20},{'w07':20}], level:8, code:'8b'},
		{name:'疾速短刀+', mts:[{'m108':12},{'w07':20},{'w08':20},{'g08d':10},{'m008c':20}], level:8, code:'8c'},
		{name:'華麗小刀', mts:[{'m108':20},{'w06':20},{'w07':20},{'w08':20},{'w09':20}], level:9, code:'9a'},
		{name:'手裡劍', mts:[{'m109':15},{'w07':20},{'w08':20},{'s07':1},{'s08':1}], level:9, code:'9b'},
		{name:'勾爪擲刀', mts:[{'m109':15},{'w07':20},{'w08':20},{'w09':20},{'w10':20}], level:10, code:'10a'},
		{name:'幻之匕首', mts:[{'m110':10},{'w10':20},{'s13':1},{'s07':1},{'s08':1}], level:10, code:'10b'},
		{name:'破滅刀', mts:[{'m108a':4},{'m109':3},{'w09':40},{'w10':40},{'s06':1}], level:11, code:'11a'},
		{name:'兇殘刀', mts:[{'m108':2},{'m109':5},{'w08a':40},{'w10':40},{'s06':2}], level:11, code:'11b'},
		{name:'水紋短劍', mts:[{'m008b':5},{'w10':40},{'w09':40},{'m110':3},{'m110b':5}], level:11, code:'11c'}
	],
// 11C小刀：水紋短劍
// 永久冰石5、梣40、絲柏40、奧利哈鋼條3、喜馬拉斯礦條5
// 12C小刀：碎藥之小刀
	wp07:[
		{name:'木製大回力鏢', mts:[{'m101':4},{'w01':20}], level:1, code:'1a'},
		{name:'青銅回力鏢', mts:[{'m101':7},{'w01':20},{'w02':20}], level:1, code:'1b'},
		{name:'追跡者', mts:[{'m101':7},{'m102':4},{'w01':20},{'w02':20}], level:2, code:'2a'},
		{name:'彩光回力鏢', mts:[{'m101':9},{'m102':6},{'w01':20},{'w02':20},{'w03':20}], level:2, code:'2b'},
		{name:'暗殺回力鏢', mts:[{'m103':5},{'w02':20},{'w03':20},{'c101':8},{'c102':6}], level:3, code:'3a'},
		{name:'殺敵回力鏢', mts:[{'m103':12},{'w02':20},{'w03':20},{'w04':20},{'c101':10}], level:3, code:'3b'},
		{name:'獅子回力鏢', mts:[{'w02':20},{'w03':20},{'w04':20},{'c103':10},{'c104':11}], level:4, code:'4a'},
		{name:'銳角回力鏢', mts:[{'m104':11},{'w03':20},{'w04':20},{'w05':20},{'c103':15}], level:4, code:'4b'},
		{name:'翼鹿回力鏢', mts:[{'w03':20},{'w04':20},{'w05':20},{'c103':15},{'c105':10}], level:5, code:'5a'},
		{name:'阿修塔羅回力鏢', mts:[{'m105':20},{'w03':20},{'w04':20},{'w05':20},{'w06':20}], level:5, code:'5b'},
		{name:'北斗之鎌刀', mts:[{'m103a':6},{'w03a':20},{'w04':20},{'w05':20},{'w06':20}], level:5, code:'5c'},
		{name:'蛇獅回力鏢', mts:[{'m106':17},{'w03':20},{'w04':20},{'w05':20},{'w06':20}], level:6, code:'6a'},
		{name:'鶇回力鏢', mts:[{'m106':17},{'w04':20},{'w05':20},{'w06':20},{'w07':20}], level:6, code:'6b'},
		{name:'雄翼牛回力鏢', mts:[{'m105':10},{'m107':10},{'w05':20},{'w06':20},{'w07':20}], level:7, code:'7a'},
		{name:'閃光回力鏢', mts:[{'m106':8},{'m107':10},{'w06':20},{'w07':20},{'s07':1}], level:7, code:'7b'},
		{name:'冰龍', mts:[{'wd07':1},{'s07':2},{'s06':2},{'w07':20}], level:7, code:'7c'},
		{name:'凶暴回力鏢', mts:[{'m106':10},{'m107':12},{'w06':20},{'w07':20},{'w08':20}], level:8, code:'8a'},
		{name:'赤獅回力鏢', mts:[{'m108':10},{'w04':20},{'w07':20},{'c105':10},{'s06':1}], level:8, code:'8b'},
		{name:'熊翼回力鏢+', mts:[{'m108':15},{'w07':20},{'w08':20},{'g08d':10},{'m008c':20}], level:8, code:'8c'},
		{name:'天使之翼', mts:[{'m107':10},{'m108':10},{'w07':20},{'w08':20},{'w09':20}], level:9, code:'9a'},
		{name:'普利辛回力鏢', mts:[{'m109':10},{'w08':20},{'w09':20},{'s07':1},{'s06':1}], level:9, code:'9b'},
		{name:'治癒回力鏢', mts:[{'m109':15},{'w08':20},{'w09':20},{'w10':20}], level:10, code:'10a'},
		{name:'天秤回力鏢', mts:[{'m110':10},{'w09':20},{'w10':20},{'s05':4},{'s08':2}], level:10, code:'10b'},
		{name:'基盤飛鏢', mts:[{'m109':8},{'w09':40},{'w08a':20},{'w10':40},{'s10':2}], level:11, code:'11a'},
		{name:'節制飛鏢', mts:[{'m108a':2},{'m109':4},{'w09':40},{'w10':40},{'s06':2}], level:11, code:'11b'},
		{name:'天穿雲', mts:[{'m008c':15},{'s05':2},{'m110b':10},{'w10a':40},{'w09':40}], level:11, code:'11c'},
		{name:'藤環', mts:[{'m008c':15},{'s05':2},{'m110b':10},{'w10a':40},{'w09':40}], level:12, code:'12a'},
		{name:'碎藥之迴力鏢', mts:[{'s07':2},{'w11':20},{'m112':11},{'m111':9},{'m110':7}], level:12, code:'12c'}
	],
// 11C鏢：天穿雲
// 藍龍之鱗15　火焰之魂2　雅達曼鎝條10　月桂木40　絲柏40
// 12鏢：藤環
// 藍龍之鱗15　火焰之魂2　雅達曼鎝條10　月桂木40　絲柏40
// 12C鏢：碎藥之迴力鏢
// 鋼騎之礦2、棗木20、鉛錠11、石墨條9、奧力哈鋼條7
	wp08:[
		{name:'番茄炸彈', mts:[{'c101':4},{'g01b':20}], level:1, pcs:2, code:'1a'},
		{name:'白米炸彈', mts:[{'m101':8},{'c101':8},{'g01e':20}], level:1, pcs:4, code:'1b'},
		{name:'石彈', mts:[{'m101':6},{'c102':4},{'w03':20},{'s01':2}], level:2, pcs:2, code:'2a'},
		{name:'火焰彈', mts:[{'m103':2},{'c102':8},{'w02':20},{'s03':8}], level:2, pcs:4, code:'2b'},
		{name:'手榴彈', mts:[{'m102':8},{'m103':6},{'w02':20},{'w03':20},{'c103':4}], level:3, pcs:2, code:'3a'},
		{name:'冷凍彈', mts:[{'m103':8},{'m104':4},{'w04':16},{'c103':8},{'s02':12}], level:3, pcs:4, code:'3b'},
		{name:'輪刃', mts:[{'m103':8},{'m104':8},{'w04':20},{'c104':4},{'s04':16}], level:4, pcs:2, code:'4a'},
		{name:'蜂巢', mts:[{'m105':8},{'m104':8},{'f03':20},{'f05':20},{'c104':8}], level:4, pcs:4, code:'4b'},
		{name:'黃色炸彈', mts:[{'m105':10},{'m104':10},{'w04':20},{'w05':20},{'c105':8}], level:5, pcs:4, code:'5a'},
		{name:'迷魂彈', mts:[{'m105':7},{'m104':8},{'m106':7},{'w06':12},{'c105':20}], level:5, pcs:6, code:'5b'},
		{name:'臭彈', mts:[{'m105':7},{'m106':8},{'w06':14},{'c106':8},{'xf10':1}], level:6, pcs:4, code:'6a'},
		{name:'狂風炸彈', mts:[{'m107':12},{'w05':12},{'w06':20},{'s04':30}], level:6, pcs:6, code:'6b'},
		{name:'催淚彈', mts:[{'m107':16},{'w06':20},{'f07':20},{'c107':8},{'s13':1}], level:7, pcs:4, code:'7a'},
		{name:'催眠彈', mts:[{'m106':12},{'m107':12},{'w05':20},{'w06':20},{'f07':20}], level:7, pcs:6, code:'7b'},
		{name:'星星彈', mts:[{'m107':20},{'w06':12},{'w07':20},{'w08':20},{'s08':1}], level:8, pcs:4, code:'8a'},
		{name:'毒氣彈', mts:[{'m108':18},{'w04':10},{'w07':20},{'c108a':12},{'g04g':1}], level:8, pcs:6, code:'8b'},
		{name:'碎紙彈', mts:[{'m108a':20},{'f01':20},{'f08a':20},{'f09':16},{'c109':16}], level:9, pcs:10, code:'9a'},
		{name:'雪花彈', mts:[{'m109':15},{'w08':20},{'m008b':12},{'s07':1},{'s08':1}], level:9, pcs:6, code:'9b'},
		{name:'銀彈', mts:[{'m109':15},{'m109a':12},{'m110a':8},{'w08a':20},{'c110':12}], level:10, pcs:10, code:'10a'},
		{name:'震撼彈', mts:[{'m110a':10},{'w10':20},{'s07':3},{'s06':2},{'s08':2}], level:10, pcs:5, code:'10b'},
		{name:'地缚彈', mts:[{'s08':5},{'f03':5},{'m109a':10},{'c108b':10},{'w11':20}], level:11, pcs:10, code:'11a'},
		{name:'千羽彈', mts:[{'s15':6},{'s16':6},{'m110':10},{'c111':10},{'w12':20}], level:12, pcs:10, code:'12a'},
		{name:'入夢彈', mts:[{'f05b':7},{'f02a':7},{'m112':10},{'c111':10},{'w12':20}], level:13, pcs:10, code:'13a'},
		{name:'水煙彈', mts:[{'m008b':7},{'f05a':7},{'m111':12},{'c114':12},{'w13':20}], level:14, pcs:10, code:'14a'},
		{name:'萬蠱彈', mts:[{'s10':2},{'g08d':10},{'m113':12},{'c114':12},{'w13':20}], level:15, pcs:10, code:'15a'}
	],
// 11級炸彈: 地缚彈
// 誓言之證5 蝴蝶花5 謝爾哈特礦條10 阿巴尼斯製的線10 棗木20
// 12級炸彈: 千羽彈
// 紅鳳凰羽毛6 藍鳳凰羽毛6 奧利哈鋼條10 鴨絨10 藤木20
// 13級炸彈: 入夢彈
// 含月草7 薄荷7 鉛錠10 鴨絨10 藤木20
// 14級炸彈: 水煙彈
// 永久冰石7 冰凍愛麗絲7 石墨條12 宁麻布12 桃花心木20
// 15級炸彈: 萬蠱彈
// 蔓陀羅草的皮2 濕地毒蛇10 朱砂錠12 宁麻布12 桃花心木20
	sh01:[
		{name:'硬皮頭盔', mts:[{'g01a':20},{'c101':2}], level:1, code:'1a'},
		{name:'銅製頭盔', mts:[{'m101':3},{'c101':3}], level:1, code:'1b'},
		{name:'鐵板布盔', mts:[{'m101':4},{'m102':2},{'c101':3}], level:2, code:'2a'},
		{name:'銅鐵皮盔', mts:[{'m101':5},{'m102':3},{'c101':2},{'c102':2}], level:2, code:'2b'},
		{name:'金屬護額', mts:[{'m101':4},{'m102':5},{'m103':3},{'c102':2}], level:3, code:'3a'},
		{name:'鐵製頭盔', mts:[{'m101':3},{'m102':10},{'m103':3},{'c103':1}], level:3, code:'3b'},
		{name:'霸葛頭盔', mts:[{'m101':4},{'m102':4},{'m103':5},{'m104':5}], level:4, code:'4a'},
		{name:'角飾頭盔', mts:[{'m101':5},{'m102':5},{'m103':5},{'m104':5},{'c104':2}], level:4, code:'4b'},
		{name:'開放式頭盔', mts:[{'m104':5},{'m105':8},{'c104':5}], level:5, code:'5a'},
		{name:'葛理克頭盔', mts:[{'m104':5},{'m105':5},{'c104':5},{'c105':5}], level:5, code:'5b'},
		{name:'聖騎士之盔', mts:[{'w03a':20},{'m104':4},{'m105':4},{'m103a':3}], level:5, code:'5c'},
		{name:'巴比克頭盔', mts:[{'m105':5},{'m106':8},{'c105':5}], level:6, code:'6a'},
		{name:'利刃頭盔', mts:[{'m105':5},{'m106':5},{'c105':5},{'c106':5}], level:6, code:'6b'},
		{name:'騎士頭盔', mts:[{'m105':8},{'m106':4},{'m107':5},{'c106':4},{'s07':1}], level:7, code:'7a'},
		{name:'鋼製頭盔', mts:[{'m106':5},{'m107':5},{'c105':9},{'w05':20},{'w07':20}], level:7, code:'7b'},
		{name:'水龍之盔', mts:[{'wd08':1},{'s07':2},{'s06':2},{'m107':10}], level:7, code:'7c'},
		{name:'博流蓋爾頭盔', mts:[{'m107':5},{'m108':5},{'c106':5},{'w07':20},{'s08':5}], level:8, code:'8a'},
		{name:'鉚釘頭盔', mts:[{'m102':10},{'m108':5},{'c107':5},{'w08':20}], level:8, code:'8b'},
		{name:'鋼製頭盔+', mts:[{'m107':7},{'m108':5},{'w08':20},{'m008b':20},{'m008c':20}], level:8, code:'8c'},
		{name:'羽毛頭盔', mts:[{'m108':3},{'m109':5},{'w07':20},{'w08':20},{'c107':3}], level:9, code:'9a'},
		{name:'龍盔', mts:[{'m109':8},{'w09':20},{'c107':4},{'s08':1},{'s07':1}], level:9, code:'9b'},
		{name:'白金頭盔', mts:[{'m108':3},{'m109':5},{'m110':3},{'w09':20},{'c107':3}], level:10, code:'10a'},
		{name:'聖龍頭盔', mts:[{'m109':5},{'m110':5},{'w10':20},{'s07':4},{'s06':4}], level:10, code:'10b'},
		{name:'正義頭盔', mts:[{'m103a':10},{'m108':7},{'m109':5},{'w08a':40},{'s08':2}], level:11, code:'11a'},
		{name:'靈力頭盔', mts:[{'m103a':9},{'m108':6},{'m109':6},{'w10':40},{'s11':2}], level:11, code:'11b'},
		{name:'棗木盔', mts:[{'s08':5},{'w11':40},{'m110a':7},{'m110':7},{'m109a':5}], level:11, code:'11c'},
		{name:'千羽盔', mts:[{'s15':6},{'w12':40},{'s07':10},{'m110':10},{'m109a':5}], level:12, code:'12a'},
		{name:'流金盔', mts:[{'m001a':2},{'w13':40},{'m111':7},{'m110':7},{'m109':5}], level:13, code:'13a'},
		{name:'綠玉盔', mts:[{'s06':7},{'w13':40},{'s07':10},{'m110b':5},{'m111':5}], level:14, code:'14a'},
		{name:'飛螢盔', mts:[{'s08':10},{'w13':40},{'m114':15},{'s07':8},{'m110b':8}], level:15, code:'15a'}
	],
// 11C盔：棗木盔
// 誓言之證5、棗木40、喜馬拉斯礦條7、奧利哈鋼條7、謝爾哈特礦條5
// 12盔：千羽盔
// 紅鳳凰羽毛6、藤木40、鋼騎之礦10、奧利哈鋼條10、謝爾哈特礦條5
// 13盔：流金盔
// 天青石2、桃花心木40、石墨條7、奧利哈鋼條7、勒格耐席姆條5
// 14盔：綠玉盔
// 魔族的水晶7、桃花心木40、鋼騎之礦10、雅達曼鎝條5、石墨條5
// 15盔：飛螢盔
// 誓言之證10、桃花心木40、紫英石15、鋼騎之礦8、雅達曼鎝條8
	sh02:[
		{name:'麻布帽', mts:[{'g01a':20},{'c101':2}], level:1, code:'1a'},
		{name:'硬帽', mts:[{'w01':20},{'g01a':20},{'c101':4}], level:1, code:'1b'},
		{name:'輕帽', mts:[{'w01':20},{'f02':20},{'c101':5},{'c102':2}], level:2, code:'2a'},
		{name:'皮帽', mts:[{'w02':20},{'f02':20},{'g01a':20},{'c101':6},{'c102':3}], level:2, code:'2b'},
		{name:'硬皮帽', mts:[{'m101':4},{'g01a':20},{'c102':5},{'c103':4}], level:3, code:'3a'},
		{name:'可愛的帽子', mts:[{'f04':20},{'c101':6},{'c102':6},{'c103':5}], level:3, code:'3b'},
		{name:'時髦帽子', mts:[{'f02':20},{'f03':20},{'c101':6},{'c103':6},{'c104':6}], level:4, code:'4a'},
		{name:'鴨舌帽', mts:[{'f04':20},{'g01a':20},{'c102':11},{'c103':11}], level:4, code:'4b'},
		{name:'藍徽章之帽', mts:[{'f04':20},{'c104':7},{'c105':10}], level:5, code:'5a'},
		{name:'高級帽子', mts:[{'f05':20},{'c104':8},{'c106':10}], level:5, code:'5b'},
		{name:'劍客帽', mts:[{'w03a':20},{'s01':2},{'f05':20},{'c103':10},{'c106':4}], level:5, code:'5c'},
		{name:'裝飾著花的帽子', mts:[{'c104':19},{'f02':20},{'f03':20},{'f04':20},{'f05':20}], level:6, code:'6a'},
		{name:'青銅帽子', mts:[{'m101':15},{'c104':14},{'f06':20}], level:6, code:'6b'},
		{name:'淑女帽', mts:[{'c105':10},{'c106':10},{'f07':20},{'s02':5}], level:7, code:'7a'},
		{name:'可愛的扁帽子', mts:[{'f05':20},{'f07':20},{'c107':13},{'s03':5}], level:7, code:'7b'},
		{name:'水龍之帽', mts:[{'wd09':1},{'s07':2},{'s06':2},{'f07':20}], level:7, code:'7c'},
		{name:'軍帽', mts:[{'f08':20},{'c104':5},{'c105':5},{'c107':10}], level:8, code:'8a'},
		{name:'時髦避暑帽', mts:[{'f06':20},{'f08':20},{'c108':10},{'s09':1}], level:8, code:'8b'},
		{name:'可愛的扁帽子+', mts:[{'f07':20},{'f08':10},{'s03':10},{'w08b':20},{'m008c':20}], level:8, code:'8c'},
		{name:'頭目帽子', mts:[{'wd09':2},{'s07':3},{'s06':3},{'f08a':20}], level:8, code:'8d'},
		{name:'羽毛帽', mts:[{'f07':20},{'f09':20},{'g01a':20},{'c107':6},{'c108':8}], level:9, code:'9a'},
		{name:'魔術師之帽', mts:[{'f08':20},{'f09':20},{'c103':20},{'c108':10},{'s06':2}], level:9, code:'9b'},
		{name:'黃昏之帽', mts:[{'f10':20},{'c104':5},{'c108':5},{'c109':7}], level:10, code:'10a'},
		{name:'妖精之帽', mts:[{'f10':20},{'c110':5},{'c106':5},{'s10':5},{'s09':2}], level:10, code:'10b'},
		{name:'貝斯神帽', mts:[{'c107':11},{'f10':40},{'f08a':40},{'s10':2},{'s12':1}], level:11, code:'11a'},
		{name:'神官帽', mts:[{'c110':16},{'s09':2},{'f09':40},{'f08a':40},{'s05':2}], level:11, code:'11b'},
		{name:'絨毛帽', mts:[{'f08a':10},{'c111':10},{'c108':15},{'c109':5},{'c106':5}], level:11, code:'11c'},
		{name:'鵝毛帽', mts:[{'s15':6},{'s16':6},{'c112':10},{'s09':5},{'c107':15}], level:12, code:'12a'},
		{name:'金絲帽', mts:[{'f10':10},{'s09':5},{'c110':15},{'c107':15},{'c108':15}], level:13, code:'13a'},
		{name:'鑲玉帽', mts:[{'m001a':10},{'f09':40},{'c110':15},{'c114':5},{'c108':15}], level:14, code:'14a'},
		{name:'紅香帽', mts:[{'s12':1},{'f06':40},{'f12':40},{'c114':5},{'c110':20}], level:15, code:'15a'}
	],
// 11C帽：絨毛帽
// 香草10　鴨絨10　傑諾瓦線15　細麻布5　絹布5
// 12級帽:鵝毛帽
// 紅鳳凰羽毛6 藍鳳凰羽毛6 鵝絨10 德特家的布5 莎蓮娜線15
// 13級帽:金絲帽
// 材料:七葉樹10 德特家的布5 開米士毛線15 莎蓮娜線15 傑諾瓦線15
// 14級帽:鑲玉帽
// 天青石10 茴香40 開米士毛線15 宁麻布5 傑諾瓦線15
// 15級帽:紅香帽
// 材料:妖草的血1, 番紅花40,  鳳仙花40, 寧麻布5, 開米士毛線20
	sh03:[
		{name:'軟皮甲', mts:[{'m101':3},{'w01':20},{'g01a':20}], level:1, code:'1a'},
		{name:'護心甲', mts:[{'m101':4},{'m102':3},{'w01':20}], level:1, code:'1b'},
		{name:'青銅鎧甲', mts:[{'m101':7},{'m102':2},{'w01':20},{'w02':20}], level:2, code:'2a'},
		{name:'輕型鎧甲', mts:[{'m101':4},{'m102':5},{'m103':3},{'g01a':20}], level:2, code:'2b'},
		{name:'輕型鎖鍊甲', mts:[{'m101':6},{'m102':10},{'w03':20}], level:3, code:'3a'},
		{name:'環甲', mts:[{'m101':5},{'m102':4},{'m103':5},{'m104':4},{'w02':20}], level:3, code:'3b'},
		{name:'鋼鐵鎧甲', mts:[{'m102':13},{'m103':4},{'m104':2},{'w03':20}], level:4, code:'4a'},
		{name:'金屬皮甲', mts:[{'m102':6},{'m103':9},{'m104':8},{'w03':20},{'w05':20}], level:4, code:'4b'},
		{name:'長型金屬鎧甲', mts:[{'m102':5},{'m103':10},{'m104':7},{'m105':5},{'w04':20}], level:5, code:'5a'},
		{name:'索狀鎧甲', mts:[{'m102':5},{'m103':5},{'m104':8},{'m105':10},{'w05':20}], level:5, code:'5b'},
		{name:'鐵齒鎧甲', mts:[{'w03a':20},{'m106':4},{'m105':5},{'m102':3},{'m103a':6}], level:5, code:'5c'},
		{name:'重鐵板甲', mts:[{'m103':5},{'m104':5},{'m105':5},{'m106':10},{'w05':20}], level:6, code:'6a'},
		{name:'鐵板半身甲', mts:[{'m103':6},{'m104':6},{'m105':6},{'m106':10},{'w06':20}], level:6, code:'6b'},
		{name:'實戰鎧甲', mts:[{'m102':20},{'m105':5},{'m106':5},{'m107':8},{'w06':20}], level:7, code:'7a'},
		{name:'黃金鎧甲', mts:[{'m104':10},{'m105':10},{'m106':10},{'m107':10},{'s10':1}], level:7, code:'7b'},
		{name:'水龍鎧甲', mts:[{'wd10':1},{'s07':2},{'s06':2},{'m107':20}], level:7, code:'7c'},
		{name:'重金屬鎧甲', mts:[{'m102':20},{'m107':10},{'m108':10}], level:8, code:'8a'},
		{name:'野獸之鎧', mts:[{'m103':15},{'m107':20},{'w06':20},{'s11':1}], level:8, code:'8b'},
		{name:'輕短鎧甲+', mts:[{'m108':13},{'m107':15},{'w07':10},{'m008b':20},{'m008c':20}], level:8, code:'8c'},
		{name:'帝王之鎧', mts:[{'m107':10},{'m108':10},{'m109':10},{'w08':20}], level:9, code:'9a'},
		{name:'亡靈鎧甲', mts:[{'m102':20},{'m107':10},{'m108':10},{'m109':12},{'s06':5}], level:9, code:'9b'},
		{name:'漆黑之鎧', mts:[{'m106':5},{'m107':5},{'m108':10},{'m109':10},{'m110':5}], level:10, code:'10a'},
		{name:'騎士鎧甲', mts:[{'m105':20},{'m109':10},{'m110':10},{'s07':5},{'s06':5}], level:10, code:'10b'},
		{name:'紅繩威鎧', mts:[{'m103a':13},{'m108a':10},{'m110':2},{'m109':10},{'s11':2}], level:11, code:'11a'},
		{name:'守護鎧甲', mts:[{'m103a':5},{'m108':10},{'m108a':4},{'m110':8},{'s12':2}], level:11, code:'11b'},
		{name:'軟蝟甲', mts:[{'s08':5},{'m109a':10},{'m110':6},{'m110b':8},{'m110a':6}], level:11, code:'11c'}
	],
// 11C鎧：軟蝟甲
// 誓言之證5、謝爾哈特礦條10、奧利哈鋼條6、雅達曼鎝條8、喜馬拉斯礦條6
	sh04:[
		{name:'旅人之服', mts:[{'g01a':20},{'c101':4},{'w01':10}], level:1, code:'1a'},
		{name:'保護衣', mts:[{'m101':3},{'g01a':20},{'c101':3},{'c102':2}], level:1, code:'1b'},
		{name:'羽毛裝', mts:[{'g01a':20},{'c101':11},{'c102':2}], level:2, code:'2a'},
		{name:'皮裝', mts:[{'m101':2},{'g01a':20},{'c101':5},{'c102':5},{'c103':4}], level:2, code:'2b'},
		{name:'硬皮服', mts:[{'m103':3},{'g01a':20},{'c101':5},{'c102':5},{'c103':6}], level:3, code:'3a'},
		{name:'鎖鏈裝', mts:[{'m102':15},{'m103':5},{'g01a':20},{'c104':2}], level:3, code:'3b'},
		{name:'布甲', mts:[{'m103':5},{'g01a':20},{'c103':7},{'c104':10}], level:4, code:'4a'},
		{name:'襯甲', mts:[{'m105':4},{'g01a':20},{'c103':10},{'c104':10}], level:4, code:'4b'},
		{name:'環服', mts:[{'m102':10},{'m105':5},{'g01a':20},{'c104':6},{'c105':5}], level:5, code:'5a'},
		{name:'士兵護衣', mts:[{'m103':5},{'m106':5},{'g01a':20},{'c104':10},{'c105':5}], level:5, code:'5b'},
		{name:'功夫裝', mts:[{'w03a':20},{'c106':4},{'m104':3},{'m105':7},{'m103a':4}], level:5, code:'5c'},
		{name:'長索錐衣', mts:[{'m102':10},{'m103':7},{'m106':5},{'g01a':20},{'c104':10}], level:6, code:'6a'},
		{name:'索錐上衣', mts:[{'m102':15},{'m105':5},{'m106':5},{'g01a':20},{'c104':10}], level:6, code:'6b'},
		{name:'骨衣', mts:[{'m106':5},{'c104':5},{'c106':5},{'c107':10}], level:7, code:'7a'},
		{name:'超級衣服', mts:[{'c104':20},{'c107':10},{'s12':1}], level:7, code:'7b'},
		{name:'水龍之衣', mts:[{'wd11':1},{'s07':2},{'s06':2},{'f07':20}], level:7, code:'7c'},
		{name:'疾風之衣', mts:[{'s01':50},{'s02':50},{'s03':50},{'s04':50},{'c108':20}], level:8, code:'8a'},
		{name:'步兵戰衣', mts:[{'m102':10},{'m108':5},{'c104':10},{'c106':10},{'c108':5}], level:8, code:'8b'},
		{name:'獸骨之衣+', mts:[{'m107':13},{'c106':15},{'c108b':10},{'w08b':20},{'m008c':20}], level:8, code:'8c'},
		{name:'勇者之衣', mts:[{'m109':1},{'c102':10},{'c105':10},{'c108':5},{'c109':10}], level:9, code:'9a'},
		{name:'女神之衣', mts:[{'c106':10},{'c108':10},{'c109':15},{'s06':1},{'s08':1}], level:9, code:'9b'},
		{name:'不死鳥之服', mts:[{'m110':1},{'c104':10},{'c106':10},{'c108':10},{'c110':10}], level:10, code:'10a'},
		{name:'靈魂之服', mts:[{'c106':20},{'c110':15},{'s13':1},{'s12':1},{'s06':4}], level:10, code:'10b'},
		{name:'海洋之服', mts:[{'m103a':5},{'m108a':6},{'m109':6},{'c108b':10},{'s11':2}], level:11, code:'11a'},
		{name:'幻想之服', mts:[{'m103a':9},{'m109':13},{'c110':20},{'w08a':40},{'s05':2}], level:11, code:'11b'},
		{name:'紫綢服', mts:[{'s08':5},{'c106':20},{'c107':10},{'m110b':8},{'m110a':6}], level:11, code:'11c'},
		{name:'彩絲裳', mts:[{'s16':6},{'c109':20},{'c108':12},{'m109a':8},{'m110':6}], level:12, code:'12a'},
		{name:'描金服', mts:[{'s05':6},{'c111':20},{'c108':12},{'m112':10},{'m109a':8}], level:13, code:'13a'}
	],
// 11C衣：紫綢服
// 誓言之證5　絹布20　莎蓮娜線10　雅達曼鎝條8　喜馬拉斯礦條6
// 12衣：彩絲裳
// 藍鳳凰的羽毛6 細麻布20 傑諾瓦線12 謝爾哈特礦條8 奧利哈鋼條6
// 13衣：描金服
// 火焰之魂6 鴨絨20 傑諾瓦線12 鉛錠10 謝爾哈特礦條8
	sh05:[
		{name:'羽毛袍', mts:[{'g01a':20},{'c101':4},{'w01':10}], level:1, code:'1a'},
		{name:'輕皮袍', mts:[{'g01a':20},{'c101':5},{'c102':4},{'w01':10}], level:1, code:'1b'},
		{name:'網袍', mts:[{'g01a':20},{'c101':2},{'c102':10},{'w02':10}], level:2, code:'2a'},
		{name:'風袍', mts:[{'g01a':20},{'c101':4},{'c102':10},{'c103':2},{'w02':10}], level:2, code:'2b'},
		{name:'硬皮袍', mts:[{'g01a':20},{'c101':7},{'c102':8},{'c103':5},{'w03':10}], level:3, code:'3a'},
		{name:'環袍', mts:[{'m102':8},{'c101':5},{'c103':7},{'c104':3},{'w03':10}], level:3, code:'3b'},
		{name:'烏鴉之袍', mts:[{'g01a':20},{'c101':10},{'c103':10},{'c104':6},{'w04':10}], level:4, code:'4a'},
		{name:'月亮之袍', mts:[{'g01a':20},{'c101':6},{'c103':10},{'c105':11},{'w04':10}], level:4, code:'4b'},
		{name:'狐皮披風', mts:[{'g04i':4},{'w02':2},{'c104':20},{'c107':4}], level:4, code:'4c'},
		{name:'東方法衣', mts:[{'g01a':20},{'c101':10},{'c104':10},{'c106':11},{'w04':10}], level:5, code:'5a'},
		{name:'聖堂之袍', mts:[{'m104':5},{'g01a':20},{'c101':5},{'c106':15},{'w05':10}], level:5, code:'5b'},
		{name:'治癒之袍', mts:[{'w03a':40},{'c106':7},{'c104':3},{'m104':4},{'m103a':4}], level:5, code:'5c'},
		{name:'聖者之袍', mts:[{'m105':10},{'c104':13},{'c106':5},{'w06':10}], level:6, code:'6a'},
		{name:'戰鬥長袍', mts:[{'m106':5},{'g01a':20},{'c104':20},{'c105':6},{'w06':10}], level:6, code:'6b'},
		{name:'冠軍之袍', mts:[{'m104':10},{'m106':10},{'c107':20},{'s08':1}], level:7, code:'7a'},
		{name:'時之袍', mts:[{'m105':5},{'m107':5},{'c104':5},{'c107':10}], level:7, code:'7b'},
		{name:'水龍法袍', mts:[{'wd12':1},{'s07':2},{'s06':2},{'w07':20}], level:7, code:'7c'},
		{name:'死神之袍', mts:[{'m108':10},{'c104':5},{'c106':5},{'c108':5},{'s13':1}], level:8, code:'8a'},
		{name:'勇者之袍', mts:[{'m106':5},{'m108':10},{'c104':5},{'c106':5},{'c108':5}], level:8, code:'8b'},
		{name:'潔淨之袍+', mts:[{'m108':5},{'c108b':10},{'c108a':20},{'w08b':20},{'m008c':20}], level:8, code:'8c'},
		{name:'黑暗之袍', mts:[{'m109':3},{'c103':5},{'c106':5},{'c108':5},{'c109':8}], level:9, code:'9a'},
		{name:'聖袍', mts:[{'m109':3},{'c105':10},{'c109':10},{'s06':1},{'s08':2}], level:9, code:'9b'},
		{name:'靈魂之袍', mts:[{'m110':2},{'c104':10},{'c106':10},{'c108':10},{'c110':5}], level:10, code:'10a'},
		{name:'奇蹟之袍', mts:[{'m110':5},{'c105':10},{'c109':15},{'s13':1},{'s06':5}], level:10, code:'10b'},
		{name:'共嗚之袍', mts:[{'c108b':10},{'w08a':20},{'w10':20},{'s10':2},{'s12':2}], level:11, code:'11a'},
		{name:'和平之袍', mts:[{'m109':13},{'c110':10},{'w08a':40},{'s11':2},{'s08':2}], level:11, code:'11b'},
		{name:'絨毛袍', mts:[{'m001a':3},{'m110':3},{'c108':10},{'c106':15},{'c109':15}], level:11, code:'11c'},
		{name:'織花袍', mts:[{'s15':6},{'s08':5},{'c105':10},{'c112':10},{'s09':15}], level:12, code:'12a'}
	],
// 11C袍：絨毛袍
// 天青石3、奧利哈鋼條3、傑諾瓦線10、絹布15、細麻布15
// 12袍：織花袍
// 紅鳳凰的羽毛6 誓言之證5 細線10 鵝絨10 德特家的布15
	sh06:[
		{name:'軟皮靴', mts:[{'g01a':20},{'c101':4}], level:1, code:'1a'},
		{name:'皮靴', mts:[{'m101':7},{'g01a':20}], level:1, code:'1b'},
		{name:'硬皮靴', mts:[{'m101':5},{'g01a':20},{'c102':4}], level:2, code:'2a'},
		{name:'長靴', mts:[{'m101':3},{'g01a':20},{'c101':3},{'c102':3},{'c103':3}], level:2, code:'2b'},
		{name:'厚底靴', mts:[{'w01':20},{'g01a':20},{'c101':8},{'c102':4},{'c103':3}], level:3, code:'3a'},
		{name:'編織的靴子', mts:[{'w02':20},{'g01a':20},{'c101':5},{'c103':9},{'c104':2}], level:3, code:'3b'},
		{name:'鎖鍊長靴', mts:[{'m102':6},{'m103':6},{'c101':6},{'c104':3}], level:4, code:'4a'},
		{name:'鎖鍊靴', mts:[{'m102':8},{'m103':3},{'m104':3},{'c103':3},{'c105':3}], level:4, code:'4b'},
		{name:'蜥蝪靴', mts:[{'m102':10},{'m105':5},{'c103':3},{'c104':3}], level:5, code:'5a'},
		{name:'蜥蝪長靴', mts:[{'m104':5},{'m105':4},{'c104':5},{'c105':5}], level:5, code:'5b'},
		{name:'防護靴', mts:[{'c106':3},{'c104':3},{'m105':2},{'m102':4},{'m103a':3}], level:5, code:'5c'},
		{name:'鋼靴', mts:[{'m102':20},{'m106':5}], level:6, code:'6a'},
		{name:'鋼製長靴', mts:[{'m103':8},{'m104':7},{'m106':7}], level:6, code:'6b'},
		{name:'水晶靴', mts:[{'m102':10},{'m105':8},{'m107':5}], level:7, code:'7a'},
		{name:'銀靴', mts:[{'m105':5},{'m106':5},{'m107':7},{'s07':1}], level:7, code:'7b'},
		{name:'水龍之靴', mts:[{'wd13':1},{'s07':2},{'s06':2},{'m107':10}], level:7, code:'7c'},
		{name:'流水之靴', mts:[{'m102':4},{'m104':4},{'m108':5},{'c107':5}], level:8, code:'8a'},
		{name:'芙蕾雅之靴', mts:[{'m107':10},{'m108':5},{'c107':5},{'s05':1}], level:8, code:'8b'},
		{name:'標準長靴+', mts:[{'m108':10},{'c108b':20},{'c108a':5},{'m008b':20},{'m008c':20}], level:8, code:'8c'},
		{name:'鑽石靴', mts:[{'m106':5},{'m107':5},{'m109':4},{'c108':5}], level:9, code:'9a'},
		{name:'鑽石長靴', mts:[{'m108':10},{'m109':5},{'s14':1},{'s07':2}], level:9, code:'9b'},
		{name:'秘密之靴', mts:[{'m105':5},{'m107':5},{'m110':5},{'c109':5}], level:10, code:'10a'},
		{name:'龍之靴', mts:[{'m109':5},{'m110':8},{'s07':5},{'s08':1}], level:10, code:'10b'},
		{name:'幸運靴', mts:[{'m108a':3},{'m110':2},{'m109':3},{'w10':40},{'s09':2}], level:11, code:'11a'},
		{name:'試力鞋', mts:[{'m103a':8},{'m108a':14},{'m108':15},{'w10':40},{'s11':2}], level:11, code:'11b'},
		{name:'彩繪靴', mts:[{'m108d':5},{'w09':40},{'m110':6},{'m110b':8},{'m110a':6}], level:11, code:'11c'},
		{name:'踏雪靴', mts:[{'m001b':7},{'w10a':40},{'m110':6},{'m110b':4},{'m110a':6}], level:12, code:'12a'},
		{name:'描金鞋', mts:[{'s07':7},{'w11':40},{'m112':10},{'m110b':6},{'m109a':10}], level:13, code:'13a'},
		{name:'雕玉履', mts:[{'m001b':7},{'w12':40},{'m112':10},{'s07':8},{'m109a':10}], level:14, code:'14a'},
		{name:'花凋靴', mts:[{'m008b':10},{'w13':40},{'m112':5},{'s07':10},{'m109a':12}], level:15, code:'15a'}
	],
// 11C靴：彩繪靴
// 萊姆騎士礦條5、絲柏40、奧利哈鋼條6、雅達曼鎝條8、喜馬拉斯礦條6
// 12靴：踏雪靴
// 瑪瑙7、月桂木40、奧利哈鋼條6、雅達曼鎝條4、喜馬拉斯礦條6
// 13靴：描金鞋
// 鋼騎之礦7、棗木40、鉛錠10、雅達曼鎝條6、謝爾哈特礦條10
// 14靴：雕玉履
// 瑪瑙7、藤木40、鉛錠10、鋼騎之礦8、謝爾哈特礦條10
// 15靴：花凋靴
// 永久冰石10、桃花心木40、鉛錠5、鋼騎之礦10、謝爾哈特礦條12
	sh07:[
		{name:'運動鞋', mts:[{'g01a':20},{'c101':4}], level:1, code:'1a'},
		{name:'馬車鞋', mts:[{'m101':3},{'g01a':20},{'c101':3}], level:1, code:'1b'},
		{name:'皮鞋', mts:[{'g01a':20},{'c101':4},{'c102':4}], level:2, code:'2a'},
		{name:'安全鞋', mts:[{'m102':4},{'g01a':20},{'c101':4},{'c102':3}], level:2, code:'2b'},
		{name:'光之鞋', mts:[{'g01a':20},{'c101':5},{'c102':4},{'c103':4}], level:3, code:'3a'},
		{name:'戰鞋', mts:[{'m101':4},{'m102':5},{'g01a':20},{'c101':2},{'c103':5}], level:3, code:'3b'},
		{name:'薄板鞋', mts:[{'m101':10},{'m102':3},{'m103':3},{'g01a':20},{'c104':3}], level:4, code:'4a'},
		{name:'鎖鏈鞋', mts:[{'m101':10},{'m102':6},{'m103':2},{'m104':2},{'c103':2}], level:4, code:'4b'},
		{name:'蜥蝪鞋', mts:[{'m103':5},{'m104':6},{'m105':3},{'c103':6}], level:5, code:'5a'},
		{name:'維京鞋', mts:[{'m101':7},{'m103':5},{'m104':5},{'m105':5},{'g01a':20}], level:5, code:'5b'},
		{name:'特製舞鞋', mts:[{'g01a':20},{'m104':2},{'m106':3},{'m105':2},{'m103a':3}], level:5, code:'5c'},
		{name:'戰鬥鞋', mts:[{'m102':20},{'m106':5}], level:6, code:'6a'},
		{name:'騎士鞋', mts:[{'m103':10},{'m104':8},{'m106':5},{'g01a':20}], level:6, code:'6b'},
		{name:'妖精鞋', mts:[{'m104':5},{'m106':5},{'m107':5},{'c107':3}], level:7, code:'7a'},
		{name:'紫水晶鞋', mts:[{'m103':5},{'m105':5},{'m107':8},{'s14':1}], level:7, code:'7b'},
		{name:'水龍之鞋', mts:[{'wd14':1},{'s07':2},{'s06':2},{'w07':20}], level:7, code:'7c'},
		{name:'白金鞋', mts:[{'m104':5},{'m106':5},{'m108':5},{'c108':3}], level:8, code:'8a'},
		{name:'精緻高根鞋', mts:[{'m107':10},{'m108':10},{'s17':1}], level:8, code:'8b'},
		{name:'妖精鞋+', mts:[{'m108':5},{'m107':3},{'c108b':17},{'g08d':10},{'m008c':20}], level:8, code:'8c'},
		{name:'神秘之鞋', mts:[{'m107':5},{'m109':4},{'c106':5},{'c109':4}], level:9, code:'9a'},
		{name:'力量之鞋', mts:[{'m109':10},{'c107':10},{'s07':2},{'s14':1}], level:9, code:'9b'},
		{name:'黃金鞋', mts:[{'m108':5},{'m110':5},{'c103':5},{'c110':5}], level:10, code:'10a'},
		{name:'龍之鞋', mts:[{'m110':10},{'c108':10},{'s07':3},{'s08':2}], level:10, code:'10b'},
		{name:'守護之鞋', mts:[{'m108a':3},{'m108':8},{'m109':8},{'c108b':3},{'s05':2}], level:11, code:'11a'},
		{name:'大木屐', mts:[{'m103a':20},{'m109':14},{'w08a':40},{'w10':40},{'s11':2}], level:11, code:'11b'},
		{name:'絨毛鞋', mts:[{'m008c':10},{'c108':5},{'m110a':10},{'w10a':40},{'w09':40}], level:11, code:'11c'},
		{name:'編藤鞋', mts:[{'m001b':7},{'c109':5},{'m110b':12},{'w10a':40},{'w12':40}], level:12, code:'12a'},
		{name:'金絲鞋', mts:[{'s06':7},{'c110':5},{'m113':15},{'w11':40},{'w13':40}], level:13, code:'13a'},
		{name:'綴玉鞋', mts:[{'s07':7},{'c108':5},{'m111':15},{'w12':40},{'w13':40}], level:14, code:'14a'},
		{name:'香織鞋', mts:[{'m008b':10},{'c114':5},{'m114':15},{'w13':40},{'w12':40}], level:15, code:'15a'}
	],
// 11C鞋：絨毛鞋
// 藍龍之鳞10 傑諾瓦線5 喜馬拉斯礦條10 月桂木40 絲柏40
// 12級鞋：編藤鞋
// 瑪瑙7、細麻布5、雅達曼鎝條12、月桂木40、藤木40
// 13級鞋：金絲鞋
// 魔族的水晶7 開米士毛線5 朱砂錠15 棗木40 桃花心木40
// 14級鞋：綴玉鞋
// 鋼騎之礦7 傑諾瓦線5 石墨條15 藤木40 桃花心木40
// 15級鞋：香織鞋
// 永久冰石10 寧麻布5 紫英石15 桃花心木40 藤木40
	sh08:[
		{name:'小圓盾', mts:[{'m101':4},{'c101':1}], level:1, code:'1a'},
		{name:'小型盾', mts:[{'m101':6},{'w02':20}], level:1, code:'1b'},
		{name:'板盾', mts:[{'m101':8},{'w01':20},{'w02':20}], level:2, code:'2a'},
		{name:'鳶盾', mts:[{'m101':7},{'m102':3},{'w01':20},{'w03':20}], level:2, code:'2b'},
		{name:'漩渦重盾', mts:[{'m102':7},{'m103':3},{'w01':20},{'w02':20},{'w03':20}], level:3, code:'3a'},
		{name:'哥特盾', mts:[{'m101':3},{'m102':4},{'m103':4},{'m104':3},{'w03':20}], level:3, code:'3b'},
		{name:'士兵盾', mts:[{'m101':4},{'m102':4},{'m103':4},{'m104':4},{'w04':20}], level:4, code:'4a'},
		{name:'重盾', mts:[{'m101':2},{'m102':2},{'m103':3},{'m104':5},{'m105':5}], level:4, code:'4b'},
		{name:'蜥蝪盾', mts:[{'m102':6},{'m103':5},{'m104':4},{'m105':3},{'w05':20}], level:5, code:'5a'},
		{name:'反光之盾', mts:[{'m102':6},{'m103':6},{'m105':4},{'m106':3}], level:5, code:'5b'},
		{name:'聖者之盾', mts:[{'w03a':20},{'m104':2},{'m106':2},{'m105':2},{'m103a':3}], level:5, code:'5c'},
		{name:'風之盾', mts:[{'m104':6},{'m105':6},{'m106':4},{'w06':20}], level:6, code:'6a'},
		{name:'獅子盾', mts:[{'m103':8},{'m105':4},{'m107':4},{'w05':20},{'w06':20}], level:6, code:'6b'},
		{name:'防守之盾', mts:[{'m102':5},{'m103':5},{'m104':5},{'m106':5},{'m107':5}], level:7, code:'7a'},
		{name:'黃金之盾', mts:[{'m105':5},{'m106':5},{'m107':15},{'s07':1}], level:7, code:'7b'},
		{name:'水龍之盾', mts:[{'wd15':1},{'s07':2},{'s06':2},{'m107':10}], level:7, code:'7c'},
		{name:'鏡之盾', mts:[{'m103':6},{'m104':6},{'m108':10}], level:8, code:'8a'},
		{name:'力量之盾', mts:[{'m108':20},{'s06':1}], level:8, code:'8b'},
		{name:'防禦之盾+', mts:[{'m107':9},{'m108':10},{'w08':20},{'m008b':20},{'m008c':20}], level:8, code:'8c'},
		{name:'漆黑之盾', mts:[{'m104':5},{'m007':5},{'m108':5},{'m109':5}], level:9, code:'9a'},
		{name:'火龍之盾', mts:[{'m106':5},{'m109':10},{'s07':1},{'s06':3}], level:9, code:'9b'},
		{name:'黑暗之盾', mts:[{'m107':5},{'m108':5},{'m109':5},{'m110':3}], level:10, code:'10a'},
		{name:'勇者之盾', mts:[{'m105':10},{'m110':8},{'s06':5},{'s08':3}], level:10, code:'10b'},
		{name:'突猛盾', mts:[{'m103a':7},{'m108a':3},{'m108':6},{'m109':6},{'s11':2}], level:11, code:'11a'},
		{name:'重型防禦盾', mts:[{'m103a':5},{'m108a':4},{'m110':3},{'m109':6},{'s08':2}], level:11, code:'11b'},
		{name:'棗木盾', mts:[{'m008c':10},{'m109a':10},{'m110':6},{'m110b':8},{'m110a':6}], level:11, code:'11c'},
		{name:'烏金盾', mts:[{'m109a':12},{'m110':12},{'m110':6},{'m110b':4},{'m110a':6}], level:12, code:'12a'}
	],
// 11C盾：棗木盾
// 藍龍之鱗10、謝爾哈特礦條10、奧利哈鋼條6、雅達曼鎝條8、喜馬拉斯礦條6
// 12盾：烏金盾
// 誓言之證5、謝爾哈特礦條12、奧利哈鋼條6、雅達曼鎝條4、喜馬拉斯礦條6
	md01:[
		{name:'生命力回復藥(100)', mts:[{'f01':10},{'f02':1}], level:1, code:'1a'},
		{name:'生命力回復藥(150)', mts:[{'f01':10},{'f02':10}], level:2, code:'2a'},
		{name:'想泉丸', mts:[{'g02f':20},{'g02g':20},{'g02h':20}], level:2, code:'2b'},
		{name:'生命力回復藥(200)', mts:[{'f01':10},{'f02':10},{'f03':5}], level:3, code:'3a'},
		{name:'猛毒的餌', mts:[{'g05a':20},{'xf11':1}], level:3, code:'3b'},
		{name:'生命力回復藥(250)', mts:[{'f02':10},{'f03':15},{'f04':5}], level:4, code:'4a'},
		{name:'迷魂藥', mts:[{'g04g':1},{'g04h':1},{'g04f':1},{'g05g':20}], level:4, code:'4b'},
		{name:'畢克銀酸', mts:[{'g04g':1},{'g04h':1},{'g04f':1},{'s22':1},{'m004':1}], level:4, code:'4c'},
		{name:'生命力回復藥(300)', mts:[{'f03':15},{'f04':15},{'f05':5}], level:5, code:'5a'},
		{name:'生命力回復藥(400)', mts:[{'f04':10},{'f05':15},{'f06':15}], level:6, code:'6a'},
		{name:'生命力回復藥(500)', mts:[{'f04':5},{'f05':13},{'f06':15},{'f07':15}], level:7, code:'7a'},
		{name:'水龍之藥', mts:[{'wd17':1},{'f07':20}], level:7, code:'7c'},
		{name:'生命力回復藥(600)', mts:[{'f01':10},{'f04':10},{'f06':10},{'f07':20},{'f08':10}], level:8, code:'8a'},
		{name:'深藍九號', mts:[{'f07':10},{'f08':10},{'w08b':20},{'g08d':10},{'s02':5}], level:8, code:'8b'},
		{name:'生命力回復藥(800)', mts:[{'f03':5},{'f06':7},{'f08':5},{'f09':10},{'f10':5}], level:9, code:'9a'},
		{name:'生命力回復藥(1000)', mts:[{'f01':10},{'f02':10},{'f08':6},{'f09':8},{'f10':10}], level:10, code:'10a'},
		{name:'生命力回復藥(1400)', mts:[{'f05':20},{'f08':20},{'f09':10},{'f10':10},{'g04f':1}], level:11, code:'11a'},
		{name:'水粉', mts:[{'w08b':1},{'f08a':3},{'f09':20},{'f02a':20},{'f01a':20}], level:11, code:'11b'}
	],
// 11B藥水：水粉
// 魔法紅蘿蔔1、香草3、茴香20、德島果蘭20、月桂樹的葉子20
// 12級藥水：指甲油
// 13級藥水：香片
// 14級藥水：忘憂湯
// 15級藥水：花露水
	fd01:[
		{name:'蕃茄醬', mts:[{'g01b':5},{'xf01':1}], level:1, code:'1a'},
		{name:'麵包', mts:[{'g01d':16},{'g02b':10},{'g03a':5}], level:1, code:'1b'},
		{name:'神聖美乃滋', mts:[{'g03a':1},{'xf03':2},{'xf04':2},{'g01c':2}], level:1, code:'1c'},
		{name:'白飯', mts:[{'xf06':5},{'g01e':5}], level:1, code:'1d'},
		{name:'美乃滋芝麻拌飯', mts:[{'g05j':1},{'xf05':3},{'xf10':3}], level:1, code:'1e'},
		{name:'蛋飯', mts:[{'xf10':3},{'g01c':10}], level:1, code:'1f'},
		{name:'蛋包飯', mts:[{'g01c':10},{'g02b':15},{'g03a':5},{'g04a':1},{'xf07':1}], level:2, code:'2a'},
		{name:'法國麵包', mts:[{'g01d':20},{'g02b':20},{'g03a':20}], level:2, code:'2b'},
		{name:'炒麵', mts:[{'g01d':20},{'g03a':10},{'g04d':20},{'g05c':12}], level:3, code:'3a'},
		{name:'青椒肉絲', mts:[{'g02c':20},{'g03a':10},{'g04c':20},{'g05a':20}], level:3, code:'3b'},
		{name:'猛毒的餌', mts:[{'g05a':20},{'xf11':1}], level:3, code:'3c'},
		{name:'燒雞', mts:[{'g03a':20},{'g04b':20},{'g05d':20},{'f02':20}], level:4, code:'4a'},
		{name:'親子丼', mts:[{'g01c':20},{'g02a':20},{'g03b':20},{'g04b':20},{'g06b':20}], level:4, code:'4b'},
		{name:'漢堡', mts:[{'g01c':20},{'g02a':20},{'xf07':3},{'g05a':20}], level:5, code:'5a'},
		{name:'星鰻飯糰', mts:[{'g03a':20},{'g03b':20},{'g04d':20},{'g05b':20},{'g06b':20}], level:5, code:'5b'},
		{name:'醬油豬骨拉麵', mts:[{'g01d':20},{'g01c':20},{'g03b':20},{'g04d':20},{'g05f':20}], level:5, code:'5c'},
		{name:'炒麵麵包', mts:[{'xf09':1},{'xf08':1}], level:6, code:'6a'},
		{name:'壽喜鍋', mts:[{'g02a':20},{'g03a':20},{'g03b':20},{'g05a':20},{'g06a':20}], level:6, code:'6b'},
		{name:'咖哩飯', mts:[{'g02a':20},{'g04b':20},{'g05e':20},{'g06b':20},{'g07c':10}], level:7, code:'7a'},
		{name:'韓式泡菜飯', mts:[{'g01c':10},{'g03a':20},{'g05a':20},{'g06b':20},{'g07b':20}], level:7, code:'7b'},
		{name:'水龍料理', mts:[{'wd16':1}], level:7, code:'7c'},
		{name:'螃蟹鍋', mts:[{'g02a':20},{'g03b':20},{'g05e':20},{'g07b':20},{'g08a':10}], level:8, code:'8a'},
		{name:'牛排', mts:[{'g03a':20},{'g05d':10},{'g05e':10},{'g07a':20},{'g08b':20}], level:8, code:'8b'},
		{name:'魅惑的哈蜜瓜麵包', mts:[{'g01d':20},{'g02b':20},{'g06a':20},{'w08b':10},{'g08c':3}], level:8, code:'8c'},
		{name:'醋飯壽司', mts:[{'g04d':20},{'g05b':20},{'g06b':20},{'g08a':20},{'g09a':10}], level:9, code:'9a'},
		{name:'豪華壽司組', mts:[{'g01c':20},{'g03b':20},{'g04d':20},{'g09a':15},{'g09b':15}], level:9, code:'9b'},
		{name:'魚翅湯', mts:[{'g01c':20},{'g02a':20},{'g03a':20},{'g05d':20},{'g10a':20}], level:10, code:'10a'},
		{name:'鱉料理', mts:[{'g07b':20},{'g08a':20},{'g09a':10},{'g09b':10},{'g10b':20}], level:10, code:'10b'},
		{name:'韓式海鮮鍋', mts:[{'g10b':20},{'g09a':40},{'g08a':20},{'g04e':20},{'xf02':3}], level:11, code:'11a'},
		{name:'豆腐', mts:[{'g03a':20},{'g11a':40}], level:11, code:'11b'},
		{name:'味增鍋', mts:[{'g03b':20},{'g02a':20},{'g05d':20},{'g03a':20},{'g10a':40}], level:12, code:'12a'}
	],
// 11B料理：豆腐
// 鹽20、黃豆40
// 12級料理：味增鍋
// 醬油20、蔥20、胡椒20、鹽20、魚翅40
// 13級料理：泡菜豆腐鍋
// 14級料理：海陸鍋
// 15級料理：三杯鼠
	sp01:[
		{name:'鹿皮手套', mts:[{'g01a':20},{'c001':20},{'c101':1}], level:1, code:'1a'},
		{name:'皮製鈴鼓', mts:[{'g01a':20},{'w01':20},{'m101':1}], level:1, code:'1b'},
		{name:'隕石之鼓', mts:[{'g01a':20},{'w02':10},{'m101':1},{'':1}], level:2, code:'2a'},
		{name:'薰香包', mts:[{'f01':10},{'f02':10},{'c101':1},{'c102':1}], level:2, code:'2b'},
		{name:'雪之結晶', mts:[{'m008b':10},{'g03a':20},{'m102':1}], level:3, code:'3a'},
		{name:'銀折扇', mts:[{'f03':10},{'m103':5},{'w03a':20}], level:3, code:'3b'},
		{name:'惡魔風笛', mts:[{'s18':1},{'w01a':20},{'m101':1},{'m102':2},{'c102':1}], level:4, code:'4a'},
		{name:'戀愛耳環', mts:[{'g05k':2},{'f01':10},{'m104':1},{'m105':3}], level:4, code:'4b'},
		{name:'淚石之戒', mts:[{'s19':1},{'m105':1},{'m104':2},{'w05':1}], level:5, code:'5a'},
		{name:'龍之環', mts:[{'g08d':5},{'m105':3},{'m104':1},{'m101':1}], level:5, code:'5b'},
		{name:'藍羽髮暨', mts:[{'s16':1},{'m106':3},{'m104':1},{'':2}], level:6, code:'6a'},
		{name:'黑魔法之戒', mts:[{'s20':1},{'m105':3},{'m104':1},{'c006':2}], level:6, code:'6b'},
		{name:'祈願之符', mts:[{'s21':1},{'c105':10},{'m107':1}], level:7, code:'7a'},
		{name:'鏡戒', mts:[{'m105':1},{'m108':1},{'w06':20}], level:7, code:'7b'},
		{name:'紅羽髮暨', mts:[{'s15':1},{'m106':3},{'m108':1},{'m005a':2}], level:8, code:'8a'},
		{name:'香草錦囊', mts:[{'f08a':20},{'w08a':20},{'c106':1},{'c108':2}], level:8, code:'8b'},
		{name:'豐年之穗', mts:[{'f08':20},{'m108a':1},{'f07':20},{'s05':2}], level:9, code:'9a'},
		{name:'茴香環', mts:[{'m109a':1},{'f09':20},{'w08':20},{'s07':2}], level:9, code:'9b'},
		{name:'奇石步搖', mts:[{'m005a':7},{'m103a':5},{'m110a':1},{'s07':2},{'w10':20}], level:10, code:'10a'},
		{name:'香柏環', mts:[{'m110a':1},{'w09':20},{'f10':20},{'m109':1}], level:10, code:'10b'},
		// {name:'文昌筆', mts:[{'f10':2},{'m112':1},{'c013':2},{'w10':5}], level:11, code:'11a'},
		// {name:'貔貅墜', mts:[{'s05':2},{'m110a':2},{'c108b':2},{'w11':5}], level:12, code:'12a'},
		// {name:'碎藥之護符', mts:[{'s06':5},{'s08':5},{'s07':5},{'s10':5},{'s11':5}], level:12, code:'12c'},
		// {name:'避毒珠', mts:[{'g10c':1},{'g08d':5},{'c108':2},{'m108d':5},{'w12':5}], level:13, code:'13a'},
		// {name:'狐仙手環', mts:[{'g04i':1},{'c114':2},{'m114':5},{'w13':5}], level:14, code:'14a'},
		// {name:'九龍珮', mts:[{'m008c':10},{'c114':2},{'m108d':10},{'m114':10},{'w14':5}], level:15, code:'15a'}
		{name:'文昌筆', mts:[{'s05':5},{'s06':5},{'c111':10},{'w11':40},{'w09':40}], level:11, code:'11a'},
		{name:'貔貅墜', mts:[{'s11':5},{'m112':15},{'c110':15},{'c108b':20},{'f12':40}], level:12, code:'12a'},
		{name:'碎藥之護符', mts:[{'s06':5},{'s08':5},{'s07':5},{'s10':5},{'s11':5}], level:12, code:'12c'},
		{name:'避毒珠', mts:[{'s05':5},{'c114':10},{'f13':40},{'m112':15},{'m113':15}], level:13, code:'13a'},
		{name:'狐仙手環', mts:[{'s07':5},{'c114':10},{'m110a':15},{'m111':20},{'m114':20}], level:14, code:'14a'},
		{name:'九龍珮', mts:[{'s08':5},{'f14':40},{'m113':20},{'m114':20},{'m115':15}], level:15, code:'15a'}
	]
// 11級飾品: 文昌筆
// 七葉樹2 鉛錠1 柞蠶絲2 梣5
// 12級飾品: 貔貅墜
// 火焰之魂2 喜馬拉斯礦條2 阿巴尼斯製的線2 棗木5
// 12C飾品: 碎藥之護符
// 魔族的水晶5 誓言之證5 鋼騎之礦5 德特家的布5 風龍蜥的甲殼5
// 13級飾品: 避毒珠
// 土龍1 濕地毒蛇5 傑諾瓦線2 萊姆騎士礦條5 藤木5
// 14級飾品: 狐仙手環
// 狐皮1 宁麻布2 紫英石5 桃花心木5
// 15級飾品: 九龍珮
// 藍龍之鱗10 宁麻布2 萊姆騎士礦條10 紫英石10 檜木5
};

// var R = new Map();
// for(let type in recipe){
// 	var _R = new Map();
// 	for(let prd in recipe[type]){
// 		let product = recipe[type][prd];
// 		_R.set(product.code, product);
// 	}
// 	R.set(type, _R);
// }
// prdRecipe = R.get(type).get(code);